app/Controllers/Usuarios.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = 9967
---
    private function buscaUsuarioOu404(int $id = null)
    {
        if(!$id || !$usuario = $this->UsuarioModel->withDeleted(true)->find($id)) {